app/views/applications/_form.html.erb

    <%= form.label :candidate_id, style: "display: block" %>
    <%= form.collection_select :candidate_id, Candidate.all, :id, :name %>
---
SELECT "candidates".* FROM "candidates"

    <%= form.label :job_offer_id, style: "display: block" %>
    <%= form.collection_select :job_offer_id, JobOffer.all, :id, :title %>
---
SELECT "job_offers".* FROM "job_offers"