app/controllers/account_creation_requests_controller.rb

  def pending_requests
    @pending_requests = AccountCreationRequest.where(approved: false)
---
SELECT "account_creation_requests".* FROM "account_creation_requests" WHERE "account_creation_requests"."approved" = $1  [["approved", false]]