app/controllers/applications_controller.rb

SELECT "applications".* FROM "applications"
---
  def index
    @applications = Application.all

INSERT INTO "applications" ("cover_letter", "candidate_id", "job_offer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cover_letter", "asdasd"], ["candidate_id", 1], ["job_offer_id", 1], ["created_at", "2023-07-27 06:08:01.410357"], ["updated_at", "2023-07-27 06:08:01.410357"]]
---
  def create
    @application = Application.new(application_params)

    respond_to do |format|
      if @application.save

UPDATE "applications" SET "updated_at" = $1 WHERE "applications"."id" = $2  [["updated_at", "2023-07-27 08:15:06.208871"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @application.update(application_params)

DELETE FROM "applications" WHERE "applications"."id" = $1  [["id", 1]]
---
  def destroy
    @application.destroy

SELECT "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_application
      @application = Application.find(params[:id])