app/controllers/candidates_controller.rb

  def index
    @candidates = Candidate.all
    @candidates = Candidate.paginate(page: params[:page], per_page: 4)
---
SELECT "candidates".* FROM "candidates" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]

    def set_candidate
      @candidate = Candidate.find(params[:id])
---
SELECT "candidates".* FROM "candidates" WHERE "candidates"."id" = $1 ORDER BY "candidates"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]