app/controllers/home_controller.rb

  def index
    @recent_job_offers = JobOffer.order(created_at: :desc).limit(5)
---
SELECT "job_offers".* FROM "job_offers" ORDER BY "job_offers"."created_at" DESC LIMIT $1  [["LIMIT", 5]]