app/controllers/job_offers_controller.rb

SELECT "job_offers".* FROM "job_offers" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 0]]
---
  def index
    @job_offers = JobOffer.all

    @job_offers = JobOffer.paginate(page: params[:page], per_page: 4)

INSERT INTO "job_offers" ("title", "description", "requirements", "salary", "expiration_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @job_offer = JobOffer.new(job_offer_params)

    respond_to do |format|
      if @job_offer.save

SELECT "job_offers".* FROM "job_offers" WHERE "job_offers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_job_offer
      @job_offer = JobOffer.find(params[:id])